[
  {
    "recipeName": "butter chicken",
    "recipeDetails": "Gunhan'in spesiyali",
    "ingredients": [
      "250 gram tereyagi",
      "1 tane sogan",
      "1 bas sarimsak",
      "1 kavanoz domates sosu",
      "1 yemek kasigi salca",
      "500 ml agir krema",
      "2 tatli kasigi tatli biber",
      "1 tatli kasigi garam masala",
      "2 yemek kasigi tandoori masala",
      "2 yemek kasigi sivi yag",
      "750 gram kusbasi tavuk",
      "Salca ve Domates sosunun tuzluluguna gore tuz"
    ],
    "steps": [
      "Buyukce bir tencereye, kusbasi tavugu ekle.",
      "Tavugun ustune sivi yag ve tandoori masalayi ekle",
      "tavuk iyice yag ve baharata bulanana kadar tahta bir kasikla karistir.",
      "Baharatlanmis tavugu kisik ateste agir agir pismeye birak. Ara ara dibine tutmamasi icin karistir.",
      "Sogani ve sarimsagi ince ince dogra.",
      "Tavuk pisince tencereye ince dogranmis sarimsak, sogan ve tereyagin bir kismini ekle, altini acip soganlar pembelesinceye kadar pisir.",
      "Soganlar da pisince geri kalan butun malzemeleri tencereye ekle.",
      "Tereyagi tamamen eriyip karisim hafif kaynamaya baslayana kadar orta-yuksek ateste isit.",
      "Karisim kaynamaya baslayinca altini en kisiga getirip 1 saat tikir tikir kaynat",
      "Haslanmis pirinc ile veya bazlama ile servis yap."
    ]
  },
  {
    "recipeName": "Krep",
    "recipeDetails": "Tam Defne'nin sevdigi gibi.",
    "ingredients": [
      "1 bardak sut",
      "1 bardak un",
      "2 yumurta"
    ],
    "steps": [
      "Buyukce bir kap cikart.",
      "Butun malzemeleri kaba ekle",
      "Un iyice cozulene kadar karisimi iyice cirp",
      "Bir tavayi orta ateste iyice isit",
      "Sicak tavada karisimi birer kepce dokup, incelmesi icin karisim pismeye baslamadan hemen yaydir",
      "Krebin ustu tamamen katilasinca ters cevir",
      "Iki tarafi da hafif kizarinca krebi tabaga al, ve karisim bitene kadar ayni sekilde pisir"
    ]
  },
  {
    "recipeName": "peach pie",
    "recipeDetails": "zxcvbnm",
    "ingredients": [
      "tempor nisi magna",
      "amet ut commodo",
      "non ea elit",
      "sit officia dolor",
      "sit cupidatat mollit",
      "ut veniam sint",
      "ea dolor sint",
      "labore eu ullamco"
    ],
    "steps": [
      "occaecat in ad dolore laborum ipsum dolore voluptate qui sunt exercitation veniam do sunt deserunt magna tempor non nisi dolor eu occaecat cupidatat anim id sunt aute voluptate esse enim",
      "qui nisi tempor proident nostrud velit duis elit aute sunt minim in proident exercitation mollit deserunt ex elit cupidatat nulla sint sint consectetur officia nisi enim deserunt proident cillum exercitation",
      "do duis tempor exercitation sunt commodo consectetur nisi aliquip deserunt esse nulla fugiat voluptate dolor reprehenderit consequat reprehenderit enim id cillum eiusmod sit fugiat consectetur velit elit voluptate nulla voluptate",
      "deserunt deserunt ex adipisicing officia ea in amet esse aute fugiat veniam consequat officia esse ad et id quis veniam sunt esse proident excepteur eiusmod veniam laborum officia consequat occaecat",
      "proident incididunt ipsum sit eiusmod nostrud sint eu nostrud elit do dolore nostrud proident elit fugiat minim ex aliqua aliqua minim non reprehenderit exercitation ullamco dolor sint culpa aliqua aliqua",
      "Lorem sunt quis velit culpa pariatur aute in ut amet duis laboris eiusmod aliqua ullamco amet adipisicing laboris elit Lorem in eu id magna magna minim veniam Lorem dolor enim",
      "nulla anim pariatur cillum enim sunt non in consequat elit qui commodo laborum occaecat aute amet officia laborum id esse officia proident ad minim consequat commodo Lorem magna enim occaecat",
      "consequat non in culpa exercitation in culpa esse ex occaecat velit reprehenderit deserunt incididunt exercitation velit enim cillum officia laborum veniam ullamco officia officia esse ipsum voluptate in esse consectetur",
      "nulla ea duis incididunt aute tempor voluptate ea anim incididunt officia duis ipsum duis officia aute non proident quis cupidatat occaecat aute occaecat cillum minim mollit et velit nulla labore",
      "nostrud nostrud ex labore sunt exercitation eiusmod cupidatat elit qui elit occaecat consectetur laboris ea cillum magna aliquip in labore incididunt adipisicing aliqua culpa id elit nisi anim officia ea"
    ]
  }
]